app/Controllers/AuthController.php

    public function login()
    {
    helper(['form']);
    $session = session();
    $userModel = new \App\Models\UserModel();
    $permisoModel = new \App\Models\PermisoRolModel();

    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    // Buscar por correo o nombre de usuario
    $user = $userModel->where('email', $username)
                      ->orWhere('user_name', $username)
                      ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'gerente'
OR `user_name` = 'gerente'
 LIMIT 1